Autodesk.Revit.DB.DimensionEqualityLabelFormatting.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the format options used to show the parameter value.
formatOptions:
The format options to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DimensionEqualityLabelFormatting uses a LabelType which does not support assignment of FormatOptions.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Suffix
The suffix to include after the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Prefix
The prefix to include before the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.#ctor(System.Int32,System.String,Autodesk.Revit.DB.LabelType,System.String,Autodesk.Revit.DB.FormatOptions)
Constructs a new instance of a DimensionEqualityLabelFormatting object with specified settings.
leadingSpaces:
The number of spaces to include before the parameter value.
prefix:
The prefix to include before the parameter value.
labelType:
The parameter value to be shown.
suffix:
The suffix to include after the parameter value.
formatOptions:
The format options to use for the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update